//-----------------------------------------------------------------------------
// File : Gimmick.cpp
// Desc : Gimmick Object.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <cassert>
#include <Gimmick.h>
#include <GameMap.h>


///////////////////////////////////////////////////////////////////////////////
// Gimmick class
///////////////////////////////////////////////////////////////////////////////

//-----------------------------------------------------------------------------
//      タイル番号から位置を設定します.
//-----------------------------------------------------------------------------
Gimmick& Gimmick::SetTilePos(int tileX, int tileY)
{
    m_Box.Pos = CalcPosFromTile(tileX, tileY);
    return *this;
}

//-----------------------------------------------------------------------------
//      サイズを設定します.
//-----------------------------------------------------------------------------
Gimmick& Gimmick::SetSize(int w, int h)
{
    m_Box.Size.x = w;
    m_Box.Size.y = h;
    return *this;
}

//-----------------------------------------------------------------------------
//      テクスチャを設定します.
//-----------------------------------------------------------------------------
Gimmick& Gimmick::SetSRV(ID3D11ShaderResourceView* pSRV)
{
    m_pSRV = pSRV;
    return *this;
}

//-----------------------------------------------------------------------------
//      状態をリセットします.
//-----------------------------------------------------------------------------
void Gimmick::Reset()
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      更新処理を行います.
//-----------------------------------------------------------------------------
void Gimmick::Update(UpdateContext& context)
{ /* DO_NOTHING */ }

//-----------------------------------------------------------------------------
//      プレイヤーが移動可能かチェックします.
//-----------------------------------------------------------------------------
bool Gimmick::CanMove(const Box& playerBox)
{ return !IsHit(playerBox, m_Box); }

//-----------------------------------------------------------------------------
//      描画処理を行います.
//-----------------------------------------------------------------------------
void Gimmick::Draw(SpriteSystem& sprite, int layer)
{ 
    sprite.Draw(
        m_pSRV,
        m_Box.Pos.x + int(m_Scroll.x),
        m_Box.Pos.y + int(m_Scroll.y),
        m_Box.Size.x,
        m_Box.Size.y,
        layer);
}

//-----------------------------------------------------------------------------
//      バウンディングボックスを取得します.
//-----------------------------------------------------------------------------
Box Gimmick::GetBox() const
{ return m_Box; }

//-----------------------------------------------------------------------------
//      シェーダリソースビューを取得します.
//-----------------------------------------------------------------------------
ID3D11ShaderResourceView* Gimmick::GetSRV() const
{ return m_pSRV; }

//-----------------------------------------------------------------------------
//      スクロール処理を行います.
//-----------------------------------------------------------------------------
void Gimmick::OnScroll(const Message& msg)
{
    auto dir = *msg.GetBufferAs<uint8_t>();
    switch(dir)
    {
    case DIRECTION_LEFT:
        if (m_Scroll.x < kMapMaxiX)
        { m_Scroll.x += kMapScrollX; }
        break;

    case DIRECTION_RIGHT:
        if (m_Scroll.x > -kMapMaxiX)
        { m_Scroll.x -= kMapScrollX; }
        break;

    case DIRECTION_UP:
        if (m_Scroll.y < kMapMaxiY)
        { m_Scroll.y += kMapScrollY; }
        break;

    case DIRECTION_DOWN:
        if (m_Scroll.y > -kMapMaxiY)
        { m_Scroll.y -= kMapScrollY; }
        break;
    }
}

//-----------------------------------------------------------------------------
//      スクロール完了時の処理です.
//-----------------------------------------------------------------------------
void Gimmick::OnScrollCompleted()
{
    m_Scroll.x = 0;
    m_Scroll.y = 0;
}
